resume/resume.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
               "http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<title>resume</title>
<meta http-equiv="Content-Type" content="text/html;charset=utf-8"/>
<meta name="title" content="resume"/>
<meta name="generator" content="Org-mode"/>
<meta name="generated" content="2016-09-02 09:50:40 中国标准时间"/>
<meta name="author" content=""/>
<meta name="description" content=""/>
<meta name="keywords" content=""/>

</head>
<body>

<div id="preamble">

</div>

<div id="content">
<h1 class="title">resume</h1>


<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#sec-1">1 个人简历</a>
<ul>
<li><a href="#sec-1-1">1.1 基本信息</a></li>
<li><a href="#sec-1-2">1.2 技能描述</a>
<ul>
<li><a href="#sec-1-2-1">1.2.1 Java</a></li>
<li><a href="#sec-1-2-2">1.2.2 Linux</a></li>
<li><a href="#sec-1-2-3">1.2.3 数据库</a></li>
<li><a href="#sec-1-2-4">1.2.4 其他</a></li>
</ul>
</li>
<li><a href="#sec-1-3">1.3 校内实践</a></li>
<li><a href="#sec-1-4">1.4 项目经验</a>
<ul>
<li><a href="#sec-1-4-1">1.4.1 河南有线网络接入认证系统</a></li>
<li><a href="#sec-1-4-2">1.4.2 河南有线网络分销系统二期</a></li>
<li><a href="#sec-1-4-3">1.4.3 基于百度地图SDK的手机定位App</a></li>
<li><a href="#sec-1-4-4">1.4.4 博客发布系统</a></li>
</ul>
</li>
<li><a href="#sec-1-5">1.5 所获奖项或证书</a></li>
<li><a href="#sec-1-6">1.6 兴趣爱好</a></li>
<li><a href="#sec-1-7">1.7 自我评价</a></li>
</ul>
</li>
</ul>
</div>
</div>

<div id="outline-container-1" class="outline-2">
<h2 id="sec-1"><span class="section-number-2">1</span> 个人简历</h2>
<div class="outline-text-2" id="text-1">


</div>

<div id="outline-container-1-1" class="outline-3">
<h3 id="sec-1-1"><span class="section-number-3">1.1</span> 基本信息</h3>
<div class="outline-text-3" id="text-1-1">

<p>姓名:胡月恒<br/>
性别:男<br/>
学历:硕士(应届毕业生)<br/>
手机:13323833820<br/>
邮箱:palagend@163.com<br/>
出生年月:1990-10-09<br/>
专业:测试计量技术及仪器(嵌入式方向)<br/>
</p></div>

</div>

<div id="outline-container-1-2" class="outline-3">
<h3 id="sec-1-2"><span class="section-number-3">1.2</span> 技能描述</h3>
<div class="outline-text-3" id="text-1-2">


</div>

<div id="outline-container-1-2-1" class="outline-4">
<h4 id="sec-1-2-1"><span class="section-number-4">1.2.1</span> Java</h4>
<div class="outline-text-4" id="text-1-2-1">

<ol>
<li>java语言基础:OOP思想,设计模式,文件IO,socket编程,多线程,JDBC,java反射机制;
</li>
<li>web基础:http,servlet,jsp;
</li>
<li>使用过的框架:Spring,Hibernate,JPA;
</li>
<li>熟悉的开发工具:Atom,Eclipse,Tomcat,Jboss,Maven
</li>
</ol>

</div>

</div>

<div id="outline-container-1-2-2" class="outline-4">
<h4 id="sec-1-2-2"><span class="section-number-4">1.2.2</span> Linux</h4>
<div class="outline-text-4" id="text-1-2-2">

<ol>
<li>熟悉的发行版:红帽系列
</li>
<li>脚本编程:bash脚本编程
</li>
<li>编辑器:vim,emacs,atom
</li>
<li>编译工具:gcc
</li>
</ol>

</div>

</div>

<div id="outline-container-1-2-3" class="outline-4">
<h4 id="sec-1-2-3"><span class="section-number-4">1.2.3</span> 数据库</h4>
<div class="outline-text-4" id="text-1-2-3">

<ol>
<li>基础:SQL
</li>
<li>MySQL(MariaDB):复杂查询,数据库备份,数据库范式
</li>
<li>Oracle:oracle工作原理
</li>
</ol>

</div>

</div>

<div id="outline-container-1-2-4" class="outline-4">
<h4 id="sec-1-2-4"><span class="section-number-4">1.2.4</span> 其他</h4>
<div class="outline-text-4" id="text-1-2-4">

<ol>
<li>Javascript,Python,Php;
</li>
<li>jQuery,Angular,easyui;
</li>
<li>Node.js;
</li>
<li>Android
</li>
</ol>

</div>
</div>

</div>

<div id="outline-container-1-3" class="outline-3">
<h3 id="sec-1-3"><span class="section-number-3">1.3</span> 校内实践</h3>
<div class="outline-text-3" id="text-1-3">

<ol>
<li>乒乓球赛;
</li>
<li>组织专业同学聚会;
</li>
<li>参加迎新晚会;
</li>
<li>踊跃参与入党积极分子培训班;
</li>
<li>在河南有线实习期间参与认证系统的维护和二次开发;
</li>
</ol>

</div>

</div>

<div id="outline-container-1-4" class="outline-3">
<h3 id="sec-1-4"><span class="section-number-3">1.4</span> 项目经验</h3>
<div class="outline-text-3" id="text-1-4">


</div>

<div id="outline-container-1-4-1" class="outline-4">
<h4 id="sec-1-4-1"><span class="section-number-4">1.4.1</span> 河南有线网络接入认证系统</h4>
<div class="outline-text-4" id="text-1-4-1">

<p><b>项目描述</b>:这是我实习期间接受的第一个工作任务,为认证系统添加radius认证功能.这是一个比较老的项目,用的是EJB和jboss技术,框架采用的是struts.<br/>
<b>项目经验</b>:第一次对旧项目做维护,感觉真的很棘手,因为之前并没有关注EJB和jboss,对struts这一过时的技术更是直接忽略;但是既然接手了任务,也只能
硬着头皮往前冲了.我先是花了一个晚上的时间恶补了EJB和jboss的知识,然后写了一些小demo练练手熟悉熟悉.等了解RMI的工作原理,jboss和tomcat之
间的关系之后,思路就清晰多了;接下来是阅读项目源码,理清逻辑结构(代码没有文档,真的很痛苦,花了不少时间).通过与业务人员的沟通,了解RADIUS认证的业务流程
,然后就是写代码了,根据OSS传过来的指令,对RADIUS数据库作相应的CRUD操作(小case).回过头来想想这整个过程,大多时间是用在学习消化新知识上面了
,而写代码本身并没有占用太多时间.这种经验,在课堂上肯定是学不来的.
</p></div>

</div>

<div id="outline-container-1-4-2" class="outline-4">
<h4 id="sec-1-4-2"><span class="section-number-4">1.4.2</span> 河南有线网络分销系统二期</h4>
<div class="outline-text-4" id="text-1-4-2">

<p><b>涉及的技术</b>:Spring, Hibernate, EasyUI, MySQL<br/>
<b>开发工具和平台</b>:MyEclipse, SVN, Atom<br/>
<b>项目描述</b>:这是一个web项目,与河南有线合作的各级代理分销商可以通过这个平台,给用户缴纳上网费<br/>
<b>项目经验</b>:说实话,这个项目的开发体验并不好,但也吸取了不少反面教训.首先是前期需求都还不确定的情况下,就要求马上开工,而且只给一个月的时间,要实现缴费,权限分配,产品宣传,报表打印,库存管理,界面还要美观大方,稳定可靠,希望开发完了马上上线,然而开发人员总共就两个.既要短平快,又要大而全,这倒还不算什么,与银行接口协议都还没谈好的情况下,就让我自己先定接口,程序先写着,说如果需求有变化,再改过来就是了(真的好无语).各部门之间扯皮,数据结构混乱,文档不全或几乎没有,有时候只能通过变量名揣测大概意思.另外进度还催得很紧,
为了赶工期,我前端选用了一个Ace模板作为框架,一些控件直接套用EasyUI,因为催得紧,人手又不够,代码大多是只求运行通过,优化比较少.一个月下来勉强完成了任务,但是整体的开发体验真的不好,虽然能运行,但是代码写的很乱.通过这一次糟糕的开发体验,我明白了,软件开发不只是纯技术的问题,软件的管理也是相当重要的,如果管理不到位,倚天剑也会被用成了砍柴刀.
</p></div>

</div>

<div id="outline-container-1-4-3" class="outline-4">
<h4 id="sec-1-4-3"><span class="section-number-4">1.4.3</span> 基于百度地图SDK的手机定位App</h4>
<div class="outline-text-4" id="text-1-4-3">

<p><b>涉及的技术</b>:Baidu LBS,Android,java<br/>
<b>开发工具和平台</b>:Android Studio,android手机<br/>
<b>项目描述</b>:这是我作毕业论文期间需要采集车辆行驶数据而编写的一个手机端定位数据采集App,功能比较简单,就是采集驾驶员行车时的定位数据并保存到本地文件中,供后期分析处理;<br/>
<b>项目收获</b>:本人主要学的是java,而安卓与java有着千丝万缕的亲缘关系,我也就尝试着做了一个android app.从android开发环境的搭建,到百度SDK的学习,从程序设计,在到app发布.整个过程都是自力更生,摸石头过河走过来的.虽然是半道出家搞android,但整个过程让我对android系统有了深入的了解.如果将来有转到android开发的需求应该不会太辛苦.<br/>
</p></div>

</div>

<div id="outline-container-1-4-4" class="outline-4">
<h4 id="sec-1-4-4"><span class="section-number-4">1.4.4</span> 博客发布系统</h4>
<div class="outline-text-4" id="text-1-4-4">

<p>经过之前糟糕的开发体验,我也找了自身的原因,技能还是不扎实,面对快节奏时才会手忙脚乱.于是抽了一段时间学习Spring的源码,并结合设计模式的书籍理解大神的设计艺术,但是总有点空空的感觉;于是我想到做一个玩具项目当做自己的练兵场,尽量把平时学到的新知识运用到这个项目中以巩固自己.项目托管在Github上(<a href="http://github.com/palagend/luna">博客发布系统</a>),git的版本控制日志可以当做自己的学习笔记.
</p></div>
</div>

</div>

<div id="outline-container-1-5" class="outline-3">
<h3 id="sec-1-5"><span class="section-number-3">1.5</span> 所获奖项或证书</h3>
<div class="outline-text-3" id="text-1-5">

<p>高级软件工程师;
高级数据库管理工程师;
系统分析师;
英语六级;
全国大学生电子设计大赛一等奖;
研究生学业奖学金;
优秀班干部;
驾驶证;
</p></div>

</div>

<div id="outline-container-1-6" class="outline-3">
<h3 id="sec-1-6"><span class="section-number-3">1.6</span> 兴趣爱好</h3>
<div class="outline-text-3" id="text-1-6">

<p>捣鼓linux,看博客,读书,听歌,爱运动
</p></div>

</div>

<div id="outline-container-1-7" class="outline-3">
<h3 id="sec-1-7"><span class="section-number-3">1.7</span> 自我评价</h3>
<div class="outline-text-3" id="text-1-7">

<ol>
<li>自学能力强. 当我面对陌生的新技术时,不会束手无策,而是通过上网搜索或是翻阅书籍自主学习新知识;在检索信息的过程中注重检索技巧, 首先粗略搜索,逛逛论坛看看博客,获取感性上的认识;然后,逐步缩小搜索范围,再阅读官方英文文档深入研究,直到get新技能.<br/>
</li>
<li>专注. 当我想做成一件事时,会自动屏蔽外界的干扰,整个脑子都被自己所想的事情给占据了,这样的发呆状态甚至会被朋友误以为抑郁了.<br/>
</li>
<li>"悲观"的豁达者. 这个"悲观"的意思不是指通常意义上的那种对生活不抱希望的意思.真正的意思是,我不大相信生活会有什么奇迹发生,对任何事情都是做好最坏的打算,然后想出尽可能多的应对方案.豁达是指,对木已成舟的过往琐事不去懊悔计较,免得让自己心烦.总之,大概就是"听天命,尽人事"的意思吧.
</li>
</ol>

</div>
</div>
</div>
</div>

<div id="postamble">
<p class="date">Date: 2016-09-02 09:50:40 中国标准时间</p>
<p class="author">Author: </p>
<p class="creator">Org version 7.8.11 with Emacs version 24</p>
<a href="http://validator.w3.org/check?uri=referer">Validate XHTML 1.0</a>

</div>
</body>
</html>
